[{"text": "--- Page 1 ---\n\nAYANDELE OREOLUWA OLUWAFEMI\nOre-02 (Ay-Ore) | Github Email: ayandeleoluwafemi@gmail.com\nAyandele Oreoluwa | Linkedin Mobile: 08126050750\nAddress: 48, Odunguwa Street, Bariga, Lagos Nigeria\nPROFESSIONAL SUMMARY\nHighly motivated and detail-oriented Cloud/DevOps enthusiast with hands-on experience in cloud\ninfrastructure, monitoring tools. Adept at troubleshooting, application performance monitoring, and\ncollaborating within technical teams. Passionate about leveraging technology to optimize operations and\nimprove user experiences.\nTECHNICAL SKILLS\n• Languages: Python, JavaScript, Bash Scripting (Linux)\n• Platforms/Tools: AWS (Amazon Web Services), Linux, Docker, GitHub, Gitlab CI\n• Soft Skills: Effective communication, team collaboration, leadership, problem-solving, time\nmanagement, adaptability, flexibility, critical thinking, attention to detail\nWORK EXPERIENCE\nInfrastructure/DevOps Trainee Yaba, Lagos (Remote)\nBincom Dev Center | Apprenticeship August 2024 - Present\n• Developed skills in cloud computing, focusing on AWS services and infrastructure management.", "metadata": {"source": "AYANDELE OREOLUWA_Resume_F.pdf", "file_id": "F08NMQ3R58F", "page": 0}}, {"text": "sent\n• Developed skills in cloud computing, focusing on AWS services and infrastructure management.\n• Gained hands-on experience with containerization technologies, including Docker.\n• Document technical processes and create detailed reports for deployment procedures\n• Collaborated with team members to automate deployment processes and improve operational efficiency.\n• Track and analyze system metrics to ensure optimal performance\nCoca-Cola HBC Ibadan, Oyo State\nEngineering Intern December 2022 – March 2023\n• Assisted the maintenance planner in scheduling and coordinating maintenance activities.\n• Monitored and analyzed production metrics using SAP, improving workflow efficiency by 15%.\n• Created detailed maintenance reports and documentation for operational processes\n• Collaborated with team members on various projects, enhancing teamwork and communication skills.\n• Gained hands-on experience in supply chain management, production processes, and maintenance\nplanning.", "metadata": {"source": "AYANDELE OREOLUWA_Resume_F.pdf", "file_id": "F08NMQ3R58F", "page": 1}}, {"text": "ned hands-on experience in supply chain management, production processes, and maintenance\nplanning.\nPROJECTS\nS3UploaderCLI\nAugust 2024\n• Developed a Bash script to upload multiple files from the home directory to a specified AWS S3 bucket.\n• Generates temporary pre-signed URLs for each uploaded file, enhancing accessibility and security\n• Created comprehensive documentation for setup and troubleshooting.\n• Ore02/S3UploaderCLI (github.com)\nStatic Website Deployment with GitLab CI/CD & Docker\nOctober 2024\n• Developed and deployed a static website using GitLab CI/CD and Docker, streamlining the development\nand deployment process.\n• Created a comprehensive GitLab CI/CD pipeline that automated testing, building, and deployment of the\nwebsite.\n• Created detailed documentation for deployment procedures and incident response\n\n--- Page 2 ---", "metadata": {"source": "AYANDELE OREOLUWA_Resume_F.pdf", "file_id": "F08NMQ3R58F", "page": 2}}, {"text": ".\n• Created detailed documentation for deployment procedures and incident response\n\n--- Page 2 ---\n\nEDUCATION\nFederal University of Technology Akure Akure,Ondo State\nBachelor of Science in Industrial and Production Engineering February 2024\n• Relevant Coursework: Operations Research, Manufacturing Processes, Quality Control, Industrial\nAutomation, Engineering Economics\nCERTIFICATES\nAWS Certified Cloud Practitioner October 2024\n• Gained foundational knowledge of AWS cloud services, architecture, and best practices for cloud\ncomputing.\n• Developed skills in cloud concepts, security, compliance, and pricing models to effectively support\norganizational needs.\nLEADERSHIP AND ACTIVITIES\nGoogle Developer Group (GDG) Akure Akure, Nigeria\nMember Sep 2020 – Present\n• Participated in workshops and meetups focused on Google technologies, enhancing technical skills and\nknowledge.\n• Contributed to community projects and hackathons, fostering collaboration and innovation among\nmembers.\n• Assisted in organizing events and promoting GDG activities within the local tech community.", "metadata": {"source": "AYANDELE OREOLUWA_Resume_F.pdf", "file_id": "F08NMQ3R58F", "page": 3}}, {"text": "bers.\n• Assisted in organizing events and promoting GDG activities within the local tech community.\nSKILLS & INTERESTS\nLanguage: English (Proficient), Yoruba (Native).\nInterests: Football (soccer), self-improvement novels, gaming, movies.", "metadata": {"source": "AYANDELE OREOLUWA_Resume_F.pdf", "file_id": "F08NMQ3R58F", "page": 4}}]